//==========================================================================
// コンスタントテーブル宣言
//==========================================================================
sampler DiffuseSampler;

//==========================================================================
// 頂点シェーダー
//==========================================================================
float4 PS(in float2 inUv : TEXCOORD0,
          in float inlight : TEXCOORD1) : COLOR0
{
  float4 color = tex2D(DiffuseSampler, inUv);
  return float4( ( color * inlight ).rgb, color.a );
}