//=============================================================================
//
// ゲームフェイズ処理ヘッダー [CGame.h]
// Author : 宗像 快
//
//=============================================================================
#pragma once
#ifndef _CGAME_H_
#define _CGAME_H_

//*****************************************************************************
// インクルード
//*****************************************************************************
#include "btBulletDynamicsCommon.h"
#include "btBulletCollisionCommon.h"

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CFade;
class CPause;
class CSceneX;

const int kPallNum = 10;

//------------------------------
// ゲームフェイズクラス
//------------------------------
class CGame {
public:
	//------------------------------
	// コンストラクタ
	//------------------------------
	CGame();

	//------------------------------
	// デストラクタ
	//------------------------------
	~CGame(){}

	//------------------------------
	// ゲームフェイズ初期化処理
	// 引数：LPDIRECT3DDEVICE9 pDevice
	// 戻値：HRESULT 成否
	//------------------------------
	HRESULT Init( LPDIRECT3DDEVICE9 pDevice );

	//------------------------------
	// ゲームフェイズ終了処理
	//------------------------------
	void Uninit();

	//------------------------------
	// ゲームフェイズ更新処理
	//------------------------------
  void Update();

  void Draw() {}

private:
	CFade		*m_pFade;			// フェイドクラスポインタ
	CPause		*m_pPause;			// ポーズクラスポインタ
  CSceneX *m_pX[2];
  btDynamicsWorld* btDynamicsWorld;   // Bulletのワールド
  btRigidBody* btGroundBody;  // 地面
  btRigidBody* btFallBody;    // 落下する物体
  btRigidBody* btPallBody[kPallNum]; // 柱
  int bulletSimulateStep;
};

#endif
// EOF