//==============================================================================
//
// スタンダードな2次元頂点データ型 [Vertex2Standard.h]
// Created : Shimizu Shoji
//
//==============================================================================
#pragma once
#ifndef __H_VERTEX2STANDARD_H__
#define __H_VERTEX2STANDARD_H__
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// include
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#include <d3dx9.h>


//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// class definition
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//------------------------------------------------
// 2次元頂点データ型
// 頂点座標, 同次座標係数, 反射光, テクスチャ座標
//------------------------------------------------
struct Vertex2Standard {
	// 頂点フォーマット
	enum { VertexDeclType = D3DFVF_XYZRHW | D3DFVF_DIFFUSE | D3DFVF_TEX1 };

	// property
	Vector3 vtx;
	float rhw;
	DWORD diffuse;
	Vector2 tex;
};


#endif // __H_VERTEX2STANDARD_H__