//==============================================================================
//
// Collision
// Author: Shimizu Shoji
//
//==============================================================================
//--=----=----=----=----=----=----=----=----=----=----=----=----=----=----=----=
// include
//--=----=----=----=----=----=----=----=----=----=----=----=----=----=----=----=
#include "collision.h"

//==============================================================================
// function implementation
//==============================================================================
//------------------------------------------------
// 2点間の距離の2乗を返す[2D]
// 加算と減算が出来ることが暗黙の型条件
//------------------------------------------------
template<typename T>
T CalcDist2(const T& ax, const T& ay, const T& bx, const T& by) {
  const T dx = (ax - bx) * (ax - bx);
  const T dy = (ay - by) * (ay - by);
  return dx + dy;
}

//------------------------------------------------
// 球x球の衝突判定[2D]
// 浮動小数点数用
//------------------------------------------------
bool IsSphereHit2(const float ax, const float ay, const float ar,
                  const float bx, const float by, const float br) {
  const float l = CalcDist2(ax, ay, bx, by);
  return (ar + br) * (ar + br) > l;
}
